Autodesk.Revit.DB.Structure.IModifyConnectionParametersServer.ModifyConnectionParameters(Autodesk.Revit.DB.Structure.ModifyConnectionParametersServiceData)
The server's method to view and modify structural connection parameters.
Remarks:
The method should always return 'true' if the server is successfully executed, no matter whether the server changes anything.
Return 'false' or if the server throws, indicates a failed case, all changes made by the server will be discarded.
data:
The data that contains the structural connection element
Returns:
Indicates whether the modify connection parameters server is executed successfully.
Since:
2017

Autodesk.Revit.DB.Structure.IModifyConnectionParametersServer
Interface for external servers implementing modifying structural connection parameters.
Remarks:
It's exposed in internal API.
Since:
2017